package week_03;

/*
 * [8-1]
 *  예외처리의 정의와 목적에 대해 설명하시오.
 */

// 정의 : 프로그램 실행시 발생할 수 있는 예상치 못한 예외를 미리 대비함.
// 목적 : 정상적인 실행상태를 유지할 수 있도록 함.

//------------------------------------------------------------------------------

/*
 * [8-2]
 * 다음은 실행도중 예외가 발생하여 화면에 출력된 내용이다. 옳지 않은것은?
 */

// d : 반대로 method1이 method2를 호출한 경우이다.

//------------------------------------------------------------------------------

/* 💢
 * [8-3]
 * 다음 중 오버라이딩이 잘못된 것은? (모두 고르시오)
 */

// 답 : d, e
// -> 부모보다 예외의 개수는 적거나 같아야한다.

//------------------------------------------------------------------------------

/*
 * [8-4]
 * 다음과 같은 메서드가 있을 때, 예외를 잘못 처리한 것은?(모두 고르시오)
 */ 

// 답 : c
// -> Exception은 최상위이기 때문에 catch문 가장 마지막에 작성되어야 한다.





